{
    "0": "70",
    "1": "383",
    "2": "22",
    "3": "748",
    "4": "887",
    "5": "750",
    "6": "662",
    "7": "82",
    "8": "641",
    "9": "594",
    "10": "852",
    "11": "407",
    "12": "167",
    "13": "597",
    "14": "926",
    "15": "661",
    "16": "475",
    "17": "439",
    "18": "528",
    "19": "573",
    "20": "909",
    "21": "980",
    "22": "224",
    "23": "679",
    "24": "516",
    "25": "583",
    "26": "877",
    "27": "449",
    "28": "117",
    "29": "200",
    "30": "836",
    "31": "229",
    "32": "52",
    "33": "211",
    "34": "545",
    "35": "94",
    "36": "732",
    "37": "550",
    "38": "989",
    "39": "61",
    "40": "118",
    "41": "493",
    "42": "496",
    "43": "469",
    "44": "765",
    "45": "587",
    "46": "527",
    "47": "787",
    "48": "138",
    "49": "999",
    "50": "136",
    "51": "636",
    "52": "848",
    "53": "807",
    "54": "245",
    "55": "44",
    "56": "533",
    "57": "979",
    "58": "600",
    "59": "547",
    "60": "892",
    "61": "369",
    "62": "539",
    "63": "901",
    "64": "531",
    "65": "552",
    "66": "285",
    "67": "490",
    "68": "580",
    "69": "381",
    "70": "591",
    "71": "834",
    "72": "378",
    "73": "225",
    "74": "273",
    "75": "540",
    "76": "221",
    "77": "33",
    "78": "134",
    "79": "275",
    "80": "579",
    "81": "755",
    "82": "568",
    "83": "938",
    "84": "676",
    "85": "532",
    "86": "294",
    "87": "160",
    "88": "913",
    "89": "688",
    "90": "622",
    "91": "151",
    "92": "189",
    "93": "625",
    "94": "183",
    "95": "78",
    "96": "258",
    "97": "387",
    "98": "694",
    "99": "142",
    "100": "146",
    "101": "855",
    "102": "466",
    "103": "770",
    "104": "511",
    "105": "186",
    "106": "912",
    "107": "188",
    "108": "816",
    "109": "482",
    "110": "919",
    "111": "192",
    "112": "500",
    "113": "763",
    "114": "413",
    "115": "73",
    "116": "923",
    "117": "634",
    "118": "56",
    "119": "195",
    "120": "291",
    "121": "990",
    "122": "956",
    "123": "241",
    "124": "21",
    "125": "161",
    "126": "187",
    "127": "850",
    "128": "321",
    "129": "860",
    "130": "289",
    "131": "182",
    "132": "924",
    "133": "737",
    "134": "427",
    "135": "406",
    "136": "47",
    "137": "576",
    "138": "179",
    "139": "670",
    "140": "360",
    "141": "504",
    "142": "993",
    "143": "891",
    "144": "915",
    "145": "803",
    "146": "339",
    "147": "728",
    "148": "873",
    "149": "422",
    "150": "9",
    "151": "718",
    "152": "130",
    "153": "920",
    "154": "639",
    "155": "723",
    "156": "719",
    "157": "349",
    "158": "949",
    "159": "722",
    "160": "978",
    "161": "509",
    "162": "791",
    "163": "380",
    "164": "133",
    "165": "297",
    "166": "612",
    "167": "793",
    "168": "838",
    "169": "262",
    "170": "91",
    "171": "977",
    "172": "951",
    "173": "125",
    "174": "823",
    "175": "310",
    "176": "984",
    "177": "884",
    "178": "67",
    "179": "206",
    "180": "246",
    "181": "159",
    "182": "992",
    "183": "497",
    "184": "145",
    "185": "492",
    "186": "939",
    "187": "828",
    "188": "300",
    "189": "168",
    "190": "588",
    "191": "459",
    "192": "235",
    "193": "696",
    "194": "648",
    "195": "772",
    "196": "857",
    "197": "513",
    "198": "149",
    "199": "955",
    "200": "590",
    "201": "626",
    "202": "886",
    "203": "553",
    "204": "958",
    "205": "830",
    "206": "673",
    "207": "353",
    "208": "194",
    "209": "767",
    "210": "36",
    "211": "214",
    "212": "391",
    "213": "109",
    "214": "410",
    "215": "895",
    "216": "647",
    "217": "280",
    "218": "918",
    "219": "598",
    "220": "37",
    "221": "689",
    "222": "249",
    "223": "178",
    "224": "631",
    "225": "16",
    "226": "24",
    "227": "254",
    "228": "752",
    "229": "657",
    "230": "804",
    "231": "242",
    "232": "231",
    "233": "301",
    "234": "518",
    "235": "742",
    "236": "703",
    "237": "795",
    "238": "839",
    "239": "344",
    "240": "506",
    "241": "861",
    "242": "434",
    "243": "438",
    "244": "786",
    "245": "462",
    "246": "783",
    "247": "129",
    "248": "890",
    "249": "228",
    "250": "172",
    "251": "833",
    "252": "775",
    "253": "715",
    "254": "162",
    "255": "483",
    "256": "561",
    "257": "299",
    "258": "846",
    "259": "431",
    "260": "277",
    "261": "205",
    "262": "717",
    "263": "328",
    "264": "39",
    "265": "713",
    "266": "711",
    "267": "766",
    "268": "155",
    "269": "120",
    "270": "352",
    "271": "481",
    "272": "237",
    "273": "473",
    "274": "401",
    "275": "204",
    "276": "354",
    "277": "103",
    "278": "700",
    "279": "893",
    "280": "112",
    "281": "544",
    "282": "476",
    "283": "564",
    "284": "346",
    "285": "330",
    "286": "567",
    "287": "261",
    "288": "372",
    "289": "548",
    "290": "565",
    "291": "121",
    "292": "144",
    "293": "957",
    "294": "902",
    "295": "97",
    "296": "710",
    "297": "610",
    "298": "239",
    "299": "869",
    "300": "226",
    "301": "538",
    "302": "687",
    "303": "874",
    "304": "101",
    "305": "358",
    "306": "283",
    "307": "48",
    "308": "995",
    "309": "454",
    "310": "99",
    "311": "403",
    "312": "741",
    "313": "69",
    "314": "3",
    "315": "288",
    "316": "842",
    "317": "908",
    "318": "812",
    "319": "569",
    "320": "889",
    "321": "542",
    "322": "654",
    "323": "566",
    "324": "318",
    "325": "820",
    "326": "727",
    "327": "879",
    "328": "266",
    "329": "616",
    "330": "520",
    "331": "110",
    "332": "472",
    "333": "371",
    "334": "642",
    "335": "624",
    "336": "6",
    "337": "180",
    "338": "50",
    "339": "946",
    "340": "609",
    "341": "744",
    "342": "106",
    "343": "629",
    "344": "627",
    "345": "313",
    "346": "98",
    "347": "247",
    "348": "859",
    "349": "970",
    "350": "374",
    "351": "303",
    "352": "165",
    "353": "790",
    "354": "395",
    "355": "802",
    "356": "762",
    "357": "51",
    "358": "49",
    "359": "760",
    "360": "837",
    "361": "100",
    "362": "611",
    "363": "577",
    "364": "491",
    "365": "880",
    "366": "452",
    "367": "724",
    "368": "560",
    "369": "397",
    "370": "733",
    "371": "296",
    "372": "196",
    "373": "60",
    "374": "681",
    "375": "417",
    "376": "667",
    "377": "608",
    "378": "824",
    "379": "317",
    "380": "89",
    "381": "287",
    "382": "382",
    "383": "365",
    "384": "952",
    "385": "716",
    "386": "414",
    "387": "77",
    "388": "286",
    "389": "695",
    "390": "991",
    "391": "708",
    "392": "948",
    "393": "555",
    "394": "435",
    "395": "640",
    "396": "602",
    "397": "826",
    "398": "442",
    "399": "865",
    "400": "425",
    "401": "876",
    "402": "808",
    "403": "440",
    "404": "832",
    "405": "660",
    "406": "663",
    "407": "917",
    "408": "298",
    "409": "79",
    "410": "361",
    "411": "815",
    "412": "863",
    "413": "932",
    "414": "323",
    "415": "485",
    "416": "805",
    "417": "905",
    "418": "618",
    "419": "735",
    "420": "656",
    "421": "115",
    "422": "123",
    "423": "773",
    "424": "86",
    "425": "969",
    "426": "433",
    "427": "398",
    "428": "207",
    "429": "443",
    "430": "131",
    "431": "342",
    "432": "747",
    "433": "295",
    "434": "651",
    "435": "356",
    "436": "495",
    "437": "792",
    "438": "665",
    "439": "0",
    "440": "764",
    "441": "31",
    "442": "578",
    "443": "393",
    "444": "488",
    "445": "479",
    "446": "739",
    "447": "961",
    "448": "394",
    "449": "965",
    "450": "971",
    "451": "260",
    "452": "429",
    "453": "316",
    "454": "347",
    "455": "215",
    "456": "896",
    "457": "322",
    "458": "169",
    "459": "549",
    "460": "331",
    "461": "122",
    "462": "519",
    "463": "628",
    "464": "537",
    "465": "690",
    "466": "503",
    "467": "467",
    "468": "505",
    "469": "17",
    "470": "404",
    "471": "428",
    "472": "685",
    "473": "778",
    "474": "137",
    "475": "445",
    "476": "899",
    "477": "177",
    "478": "218",
    "479": "799",
    "480": "64",
    "481": "486",
    "482": "950",
    "483": "230",
    "484": "818",
    "485": "157",
    "486": "85",
    "487": "436",
    "488": "621",
    "489": "240",
    "490": "140",
    "491": "259",
    "492": "927",
    "493": "878",
    "494": "753",
    "495": "15",
    "496": "8",
    "497": "968",
    "498": "633",
    "499": "335",
    "500": "396",
    "501": "74",
    "502": "603",
    "503": "307",
    "504": "658",
    "505": "613",
    "506": "59",
    "507": "811",
    "508": "197",
    "509": "304",
    "510": "986",
    "511": "43",
    "512": "88",
    "513": "148",
    "514": "7",
    "515": "589",
    "516": "54",
    "517": "164",
    "518": "14",
    "519": "12",
    "520": "222",
    "521": "334",
    "522": "489",
    "523": "181",
    "524": "62",
    "525": "843",
    "526": "93",
    "527": "190",
    "528": "451",
    "529": "388",
    "530": "29",
    "531": "551",
    "532": "738",
    "533": "936",
    "534": "478",
    "535": "907",
    "536": "981",
    "537": "384",
    "538": "623",
    "539": "785",
    "540": "426",
    "541": "87",
    "542": "42",
    "543": "10",
    "544": "558",
    "545": "199",
    "546": "448",
    "547": "851",
    "548": "468",
    "549": "931",
    "550": "678",
    "551": "156",
    "552": "135",
    "553": "653",
    "554": "668",
    "555": "944",
    "556": "153",
    "557": "302",
    "558": "416",
    "559": "556",
    "560": "945",
    "561": "872",
    "562": "213",
    "563": "702",
    "564": "827",
    "565": "255",
    "566": "2",
    "567": "835",
    "568": "960",
    "569": "290",
    "570": "132",
    "571": "585",
    "572": "348",
    "573": "35",
    "574": "362",
    "575": "53",
    "576": "250",
    "577": "985",
    "578": "810",
    "579": "844",
    "580": "925",
    "581": "781",
    "582": "184",
    "583": "712",
    "584": "386",
    "585": "643",
    "586": "574",
    "587": "421",
    "588": "693",
    "589": "789",
    "590": "113",
    "591": "972",
    "592": "465",
    "593": "867",
    "594": "76",
    "595": "745",
    "596": "714",
    "597": "510",
    "598": "430",
    "599": "461",
    "600": "987",
    "601": "319",
    "602": "962",
    "603": "768",
    "604": "55",
    "605": "825",
    "606": "930",
    "607": "326",
    "608": "683",
    "609": "447",
    "610": "292",
    "611": "377",
    "612": "363",
    "613": "515",
    "614": "630",
    "615": "405",
    "616": "83",
    "617": "897",
    "618": "646",
    "619": "236",
    "620": "499",
    "621": "769",
    "622": "522",
    "623": "248",
    "624": "941",
    "625": "512",
    "626": "90",
    "627": "345",
    "628": "706",
    "629": "367",
    "630": "13",
    "631": "954",
    "632": "450",
    "633": "697",
    "634": "26",
    "635": "729",
    "636": "147",
    "637": "871",
    "638": "376",
    "639": "649",
    "640": "402",
    "641": "46",
    "642": "888",
    "643": "645",
    "644": "355",
    "645": "801",
    "646": "219",
    "647": "994",
    "648": "605",
    "649": "666",
    "650": "725",
    "651": "191",
    "652": "875",
    "653": "652",
    "654": "900",
    "655": "253",
    "656": "731",
    "657": "166",
    "658": "210",
    "659": "514",
    "660": "111",
    "661": "108",
    "662": "606",
    "663": "635",
    "664": "324",
    "665": "976",
    "666": "928",
    "667": "601",
    "668": "535",
    "669": "18",
    "670": "385",
    "671": "726",
    "672": "743",
    "673": "973",
    "674": "252",
    "675": "80",
    "676": "701",
    "677": "784",
    "678": "325",
    "679": "471",
    "680": "831",
    "681": "705",
    "682": "498",
    "683": "637",
    "684": "858",
    "685": "943",
    "686": "220",
    "687": "929",
    "688": "571",
    "689": "777",
    "690": "351",
    "691": "170",
    "692": "813",
    "693": "885",
    "694": "581",
    "695": "408",
    "696": "620",
    "697": "797",
    "698": "757",
    "699": "940",
    "700": "659",
    "701": "575",
    "702": "163",
    "703": "278",
    "704": "366",
    "705": "455",
    "706": "736",
    "707": "541",
    "708": "4",
    "709": "517",
    "710": "217",
    "711": "175",
    "712": "28",
    "713": "894",
    "714": "370",
    "715": "866",
    "716": "906",
    "717": "975",
    "718": "25",
    "719": "854",
    "720": "276",
    "721": "314",
    "722": "265",
    "723": "508",
    "724": "592",
    "725": "419",
    "726": "682",
    "727": "65",
    "728": "124",
    "729": "19",
    "730": "814",
    "731": "457",
    "732": "198",
    "733": "911",
    "734": "312",
    "735": "119",
    "736": "432",
    "737": "692",
    "738": "933",
    "739": "400",
    "740": "107",
    "741": "338",
    "742": "309",
    "743": "437",
    "744": "821",
    "745": "34",
    "746": "329",
    "747": "154",
    "748": "864",
    "749": "92",
    "750": "337",
    "751": "234",
    "752": "959",
    "753": "390",
    "754": "470",
    "755": "819",
    "756": "174",
    "757": "1",
    "758": "526",
    "759": "30",
    "760": "686",
    "761": "632",
    "762": "399",
    "763": "315",
    "764": "559",
    "765": "63",
    "766": "582",
    "767": "502",
    "768": "881",
    "769": "343",
    "770": "272",
    "771": "720",
    "772": "593",
    "773": "779",
    "774": "20",
    "775": "274",
    "776": "644",
    "777": "546",
    "778": "389",
    "779": "114",
    "780": "734",
    "781": "171",
    "782": "822",
    "783": "202",
    "784": "66",
    "785": "664",
    "786": "128",
    "787": "474",
    "788": "209",
    "789": "357",
    "790": "102",
    "791": "680",
    "792": "759",
    "793": "456",
    "794": "373",
    "795": "800",
    "796": "596",
    "797": "617",
    "798": "58",
    "799": "707",
    "800": "898",
    "801": "677",
    "802": "937",
    "803": "554",
    "804": "233",
    "805": "379",
    "806": "862",
    "807": "691",
    "808": "914",
    "809": "619",
    "810": "143",
    "811": "536",
    "812": "282",
    "813": "615",
    "814": "23",
    "815": "320",
    "816": "684",
    "817": "607",
    "818": "809",
    "819": "203",
    "820": "460",
    "821": "306",
    "822": "557",
    "823": "27",
    "824": "829",
    "825": "584",
    "826": "216",
    "827": "243",
    "828": "68",
    "829": "281",
    "830": "57",
    "831": "947",
    "832": "193",
    "833": "185",
    "834": "840",
    "835": "269",
    "836": "268",
    "837": "882",
    "838": "796",
    "839": "669",
    "840": "761",
    "841": "595",
    "842": "521",
    "843": "212",
    "844": "740",
    "845": "176",
    "846": "201",
    "847": "817",
    "848": "392",
    "849": "257",
    "850": "868",
    "851": "922",
    "852": "953",
    "853": "238",
    "854": "847",
    "855": "104",
    "856": "41",
    "857": "570",
    "858": "996",
    "859": "458",
    "860": "599",
    "861": "746",
    "862": "671",
    "863": "327",
    "864": "982",
    "865": "271",
    "866": "910",
    "867": "127",
    "868": "614",
    "869": "293",
    "870": "487",
    "871": "484",
    "872": "256",
    "873": "232",
    "874": "974",
    "875": "916",
    "876": "126",
    "877": "81",
    "878": "270",
    "879": "96",
    "880": "964",
    "881": "368",
    "882": "116",
    "883": "788",
    "884": "758",
    "885": "655",
    "886": "756",
    "887": "543",
    "888": "251",
    "889": "650",
    "890": "332",
    "891": "904",
    "892": "139",
    "893": "359",
    "894": "105",
    "895": "267",
    "896": "730",
    "897": "776",
    "898": "244",
    "899": "794",
    "900": "841",
    "901": "208",
    "902": "563",
    "903": "411",
    "904": "71",
    "905": "998",
    "906": "453",
    "907": "572",
    "908": "418",
    "909": "586",
    "910": "95",
    "911": "477",
    "912": "562",
    "913": "845",
    "914": "263",
    "915": "988",
    "916": "749",
    "917": "935",
    "918": "32",
    "919": "967",
    "920": "11",
    "921": "340",
    "922": "529",
    "923": "699",
    "924": "158",
    "925": "45",
    "926": "441",
    "927": "921",
    "928": "284",
    "929": "507",
    "930": "966",
    "931": "782",
    "932": "40",
    "933": "308",
    "934": "420",
    "935": "638",
    "936": "38",
    "937": "72",
    "938": "771",
    "939": "963",
    "940": "704",
    "941": "279",
    "942": "173",
    "943": "754",
    "944": "674",
    "945": "856",
    "946": "412",
    "947": "141",
    "948": "798",
    "949": "853",
    "950": "463",
    "951": "375",
    "952": "709",
    "953": "806",
    "954": "223",
    "955": "751",
    "956": "150",
    "957": "333",
    "958": "152",
    "959": "336",
    "960": "494",
    "961": "534",
    "962": "997",
    "963": "523",
    "964": "721",
    "965": "524",
    "966": "350",
    "967": "780",
    "968": "604",
    "969": "305",
    "970": "84",
    "971": "480",
    "972": "446",
    "973": "983",
    "974": "311",
    "975": "424",
    "976": "774",
    "977": "849",
    "978": "883",
    "979": "672",
    "980": "364",
    "981": "934",
    "982": "501",
    "983": "423",
    "984": "5",
    "985": "444",
    "986": "464",
    "987": "341",
    "988": "415",
    "989": "942",
    "990": "409",
    "991": "227",
    "992": "525",
    "993": "870",
    "994": "698",
    "995": "903",
    "996": "675",
    "997": "530",
    "998": "264",
    "999": "75"
}