{
    "0": "110",
    "1": "510",
    "2": "303",
    "3": "799",
    "4": "122",
    "5": "106",
    "6": "476",
    "7": "391",
    "8": "641",
    "9": "217",
    "10": "493",
    "11": "422",
    "12": "800",
    "13": "208",
    "14": "693",
    "15": "339",
    "16": "747",
    "17": "839",
    "18": "947",
    "19": "415",
    "20": "714",
    "21": "190",
    "22": "294",
    "23": "264",
    "24": "250",
    "25": "789",
    "26": "696",
    "27": "542",
    "28": "375",
    "29": "451",
    "30": "33",
    "31": "547",
    "32": "259",
    "33": "416",
    "34": "455",
    "35": "764",
    "36": "427",
    "37": "236",
    "38": "522",
    "39": "61",
    "40": "803",
    "41": "629",
    "42": "458",
    "43": "66",
    "44": "735",
    "45": "599",
    "46": "171",
    "47": "725",
    "48": "402",
    "49": "42",
    "50": "198",
    "51": "425",
    "52": "133",
    "53": "862",
    "54": "585",
    "55": "798",
    "56": "886",
    "57": "511",
    "58": "549",
    "59": "648",
    "60": "376",
    "61": "111",
    "62": "261",
    "63": "226",
    "64": "274",
    "65": "808",
    "66": "335",
    "67": "967",
    "68": "610",
    "69": "713",
    "70": "622",
    "71": "148",
    "72": "543",
    "73": "255",
    "74": "470",
    "75": "38",
    "76": "372",
    "77": "507",
    "78": "242",
    "79": "405",
    "80": "971",
    "81": "670",
    "82": "115",
    "83": "390",
    "84": "135",
    "85": "349",
    "86": "779",
    "87": "954",
    "88": "246",
    "89": "962",
    "90": "838",
    "91": "393",
    "92": "347",
    "93": "247",
    "94": "389",
    "95": "276",
    "96": "445",
    "97": "144",
    "98": "210",
    "99": "478",
    "100": "74",
    "101": "525",
    "102": "814",
    "103": "928",
    "104": "823",
    "105": "776",
    "106": "270",
    "107": "744",
    "108": "552",
    "109": "518",
    "110": "300",
    "111": "414",
    "112": "782",
    "113": "846",
    "114": "241",
    "115": "140",
    "116": "567",
    "117": "926",
    "118": "187",
    "119": "969",
    "120": "832",
    "121": "529",
    "122": "214",
    "123": "548",
    "124": "556",
    "125": "442",
    "126": "248",
    "127": "652",
    "128": "824",
    "129": "606",
    "130": "460",
    "131": "32",
    "132": "945",
    "133": "523",
    "134": "820",
    "135": "812",
    "136": "249",
    "137": "429",
    "138": "827",
    "139": "899",
    "140": "638",
    "141": "134",
    "142": "925",
    "143": "182",
    "144": "500",
    "145": "160",
    "146": "170",
    "147": "332",
    "148": "320",
    "149": "78",
    "150": "715",
    "151": "784",
    "152": "898",
    "153": "172",
    "154": "207",
    "155": "841",
    "156": "843",
    "157": "580",
    "158": "743",
    "159": "240",
    "160": "546",
    "161": "942",
    "162": "113",
    "163": "117",
    "164": "753",
    "165": "154",
    "166": "822",
    "167": "420",
    "168": "805",
    "169": "132",
    "170": "413",
    "171": "486",
    "172": "268",
    "173": "810",
    "174": "769",
    "175": "363",
    "176": "854",
    "177": "8",
    "178": "180",
    "179": "373",
    "180": "484",
    "181": "903",
    "182": "581",
    "183": "979",
    "184": "831",
    "185": "902",
    "186": "654",
    "187": "356",
    "188": "502",
    "189": "766",
    "190": "371",
    "191": "221",
    "192": "492",
    "193": "582",
    "194": "851",
    "195": "279",
    "196": "408",
    "197": "260",
    "198": "992",
    "199": "254",
    "200": "230",
    "201": "617",
    "202": "73",
    "203": "767",
    "204": "564",
    "205": "104",
    "206": "157",
    "207": "601",
    "208": "475",
    "209": "889",
    "210": "461",
    "211": "481",
    "212": "299",
    "213": "457",
    "214": "430",
    "215": "424",
    "216": "705",
    "217": "188",
    "218": "664",
    "219": "209",
    "220": "47",
    "221": "533",
    "222": "44",
    "223": "220",
    "224": "565",
    "225": "343",
    "226": "239",
    "227": "316",
    "228": "866",
    "229": "173",
    "230": "698",
    "231": "350",
    "232": "267",
    "233": "357",
    "234": "19",
    "235": "937",
    "236": "984",
    "237": "718",
    "238": "54",
    "239": "813",
    "240": "364",
    "241": "31",
    "242": "468",
    "243": "572",
    "244": "981",
    "245": "70",
    "246": "118",
    "247": "908",
    "248": "539",
    "249": "864",
    "250": "605",
    "251": "191",
    "252": "348",
    "253": "206",
    "254": "116",
    "255": "859",
    "256": "288",
    "257": "770",
    "258": "334",
    "259": "164",
    "260": "494",
    "261": "16",
    "262": "438",
    "263": "177",
    "264": "156",
    "265": "615",
    "266": "477",
    "267": "79",
    "268": "378",
    "269": "662",
    "270": "100",
    "271": "607",
    "272": "265",
    "273": "950",
    "274": "538",
    "275": "136",
    "276": "35",
    "277": "786",
    "278": "431",
    "279": "432",
    "280": "938",
    "281": "710",
    "282": "829",
    "283": "861",
    "284": "773",
    "285": "167",
    "286": "253",
    "287": "449",
    "288": "333",
    "289": "406",
    "290": "359",
    "291": "825",
    "292": "28",
    "293": "69",
    "294": "387",
    "295": "697",
    "296": "444",
    "297": "465",
    "298": "642",
    "299": "858",
    "300": "848",
    "301": "52",
    "302": "282",
    "303": "161",
    "304": "576",
    "305": "392",
    "306": "611",
    "307": "127",
    "308": "26",
    "309": "181",
    "310": "625",
    "311": "341",
    "312": "788",
    "313": "614",
    "314": "584",
    "315": "439",
    "316": "124",
    "317": "852",
    "318": "982",
    "319": "719",
    "320": "732",
    "321": "907",
    "322": "955",
    "323": "84",
    "324": "473",
    "325": "101",
    "326": "256",
    "327": "138",
    "328": "403",
    "329": "3",
    "330": "94",
    "331": "674",
    "332": "836",
    "333": "4",
    "334": "193",
    "335": "857",
    "336": "471",
    "337": "671",
    "338": "655",
    "339": "202",
    "340": "497",
    "341": "162",
    "342": "317",
    "343": "29",
    "344": "728",
    "345": "56",
    "346": "183",
    "347": "791",
    "348": "314",
    "349": "199",
    "350": "331",
    "351": "894",
    "352": "806",
    "353": "759",
    "354": "703",
    "355": "837",
    "356": "885",
    "357": "149",
    "358": "860",
    "359": "277",
    "360": "67",
    "361": "223",
    "362": "616",
    "363": "526",
    "364": "650",
    "365": "688",
    "366": "794",
    "367": "785",
    "368": "400",
    "369": "49",
    "370": "959",
    "371": "626",
    "372": "421",
    "373": "201",
    "374": "175",
    "375": "636",
    "376": "970",
    "377": "963",
    "378": "681",
    "379": "27",
    "380": "575",
    "381": "383",
    "382": "941",
    "383": "591",
    "384": "258",
    "385": "365",
    "386": "830",
    "387": "229",
    "388": "499",
    "389": "720",
    "390": "319",
    "391": "863",
    "392": "275",
    "393": "411",
    "394": "98",
    "395": "956",
    "396": "68",
    "397": "398",
    "398": "874",
    "399": "893",
    "400": "184",
    "401": "7",
    "402": "993",
    "403": "531",
    "404": "65",
    "405": "22",
    "406": "215",
    "407": "186",
    "408": "382",
    "409": "701",
    "410": "692",
    "411": "266",
    "412": "273",
    "413": "667",
    "414": "763",
    "415": "41",
    "416": "308",
    "417": "197",
    "418": "960",
    "419": "631",
    "420": "691",
    "421": "153",
    "422": "495",
    "423": "957",
    "424": "835",
    "425": "877",
    "426": "958",
    "427": "532",
    "428": "336",
    "429": "96",
    "430": "683",
    "431": "734",
    "432": "446",
    "433": "97",
    "434": "904",
    "435": "573",
    "436": "370",
    "437": "730",
    "438": "842",
    "439": "976",
    "440": "604",
    "441": "946",
    "442": "469",
    "443": "916",
    "444": "740",
    "445": "975",
    "446": "579",
    "447": "262",
    "448": "973",
    "449": "558",
    "450": "329",
    "451": "578",
    "452": "880",
    "453": "302",
    "454": "17",
    "455": "760",
    "456": "647",
    "457": "900",
    "458": "729",
    "459": "482",
    "460": "15",
    "461": "755",
    "462": "920",
    "463": "559",
    "464": "369",
    "465": "709",
    "466": "787",
    "467": "872",
    "468": "772",
    "469": "419",
    "470": "18",
    "471": "93",
    "472": "716",
    "473": "120",
    "474": "673",
    "475": "535",
    "476": "36",
    "477": "337",
    "478": "778",
    "479": "105",
    "480": "868",
    "481": "34",
    "482": "594",
    "483": "51",
    "484": "587",
    "485": "914",
    "486": "377",
    "487": "990",
    "488": "296",
    "489": "83",
    "490": "704",
    "491": "293",
    "492": "588",
    "493": "2",
    "494": "906",
    "495": "281",
    "496": "521",
    "497": "706",
    "498": "501",
    "499": "972",
    "500": "91",
    "501": "309",
    "502": "678",
    "503": "987",
    "504": "131",
    "505": "807",
    "506": "327",
    "507": "792",
    "508": "612",
    "509": "657",
    "510": "923",
    "511": "684",
    "512": "404",
    "513": "702",
    "514": "905",
    "515": "45",
    "516": "0",
    "517": "102",
    "518": "675",
    "519": "271",
    "520": "536",
    "521": "285",
    "522": "995",
    "523": "301",
    "524": "968",
    "525": "1",
    "526": "568",
    "527": "152",
    "528": "487",
    "529": "544",
    "530": "515",
    "531": "109",
    "532": "932",
    "533": "917",
    "534": "570",
    "535": "464",
    "536": "757",
    "537": "537",
    "538": "517",
    "539": "840",
    "540": "298",
    "541": "566",
    "542": "237",
    "543": "130",
    "544": "325",
    "545": "802",
    "546": "597",
    "547": "12",
    "548": "602",
    "549": "506",
    "550": "58",
    "551": "354",
    "552": "399",
    "553": "488",
    "554": "991",
    "555": "933",
    "556": "721",
    "557": "366",
    "558": "360",
    "559": "92",
    "560": "748",
    "561": "307",
    "562": "653",
    "563": "887",
    "564": "232",
    "565": "195",
    "566": "322",
    "567": "244",
    "568": "555",
    "569": "603",
    "570": "633",
    "571": "821",
    "572": "289",
    "573": "466",
    "574": "474",
    "575": "891",
    "576": "496",
    "577": "961",
    "578": "519",
    "579": "151",
    "580": "918",
    "581": "150",
    "582": "448",
    "583": "809",
    "584": "311",
    "585": "989",
    "586": "352",
    "587": "620",
    "588": "986",
    "589": "980",
    "590": "875",
    "591": "828",
    "592": "682",
    "593": "485",
    "594": "583",
    "595": "966",
    "596": "940",
    "597": "386",
    "598": "50",
    "599": "59",
    "600": "472",
    "601": "228",
    "602": "89",
    "603": "139",
    "604": "524",
    "605": "833",
    "606": "726",
    "607": "10",
    "608": "651",
    "609": "609",
    "610": "462",
    "611": "896",
    "612": "639",
    "613": "55",
    "614": "489",
    "615": "853",
    "616": "43",
    "617": "844",
    "618": "965",
    "619": "13",
    "620": "412",
    "621": "88",
    "622": "707",
    "623": "624",
    "624": "534",
    "625": "881",
    "626": "251",
    "627": "245",
    "628": "234",
    "629": "613",
    "630": "312",
    "631": "443",
    "632": "107",
    "633": "717",
    "634": "338",
    "635": "793",
    "636": "48",
    "637": "845",
    "638": "409",
    "639": "213",
    "640": "346",
    "641": "252",
    "642": "983",
    "643": "897",
    "644": "129",
    "645": "927",
    "646": "711",
    "647": "509",
    "648": "919",
    "649": "434",
    "650": "483",
    "651": "297",
    "652": "911",
    "653": "669",
    "654": "165",
    "655": "855",
    "656": "826",
    "657": "219",
    "658": "103",
    "659": "159",
    "660": "272",
    "661": "147",
    "662": "665",
    "663": "194",
    "664": "459",
    "665": "934",
    "666": "551",
    "667": "95",
    "668": "913",
    "669": "62",
    "670": "646",
    "671": "397",
    "672": "394",
    "673": "176",
    "674": "168",
    "675": "428",
    "676": "577",
    "677": "40",
    "678": "952",
    "679": "888",
    "680": "269",
    "681": "811",
    "682": "815",
    "683": "571",
    "684": "395",
    "685": "871",
    "686": "977",
    "687": "385",
    "688": "344",
    "689": "204",
    "690": "504",
    "691": "218",
    "692": "948",
    "693": "661",
    "694": "141",
    "695": "450",
    "696": "384",
    "697": "876",
    "698": "121",
    "699": "554",
    "700": "72",
    "701": "999",
    "702": "145",
    "703": "600",
    "704": "722",
    "705": "910",
    "706": "512",
    "707": "304",
    "708": "233",
    "709": "24",
    "710": "388",
    "711": "598",
    "712": "708",
    "713": "528",
    "714": "417",
    "715": "310",
    "716": "23",
    "717": "882",
    "718": "590",
    "719": "381",
    "720": "315",
    "721": "749",
    "722": "280",
    "723": "724",
    "724": "953",
    "725": "680",
    "726": "540",
    "727": "9",
    "728": "563",
    "729": "751",
    "730": "731",
    "731": "818",
    "732": "865",
    "733": "589",
    "734": "608",
    "735": "112",
    "736": "21",
    "737": "426",
    "738": "362",
    "739": "783",
    "740": "81",
    "741": "503",
    "742": "374",
    "743": "817",
    "744": "212",
    "745": "687",
    "746": "834",
    "747": "235",
    "748": "780",
    "749": "313",
    "750": "6",
    "751": "169",
    "752": "196",
    "753": "974",
    "754": "690",
    "755": "700",
    "756": "619",
    "757": "224",
    "758": "816",
    "759": "668",
    "760": "436",
    "761": "330",
    "762": "699",
    "763": "737",
    "764": "931",
    "765": "75",
    "766": "222",
    "767": "754",
    "768": "856",
    "769": "128",
    "770": "561",
    "771": "291",
    "772": "37",
    "773": "736",
    "774": "569",
    "775": "739",
    "776": "663",
    "777": "318",
    "778": "640",
    "779": "57",
    "780": "790",
    "781": "659",
    "782": "76",
    "783": "163",
    "784": "623",
    "785": "353",
    "786": "545",
    "787": "71",
    "788": "142",
    "789": "644",
    "790": "321",
    "791": "795",
    "792": "553",
    "793": "765",
    "794": "345",
    "795": "677",
    "796": "996",
    "797": "884",
    "798": "723",
    "799": "762",
    "800": "635",
    "801": "440",
    "802": "326",
    "803": "25",
    "804": "935",
    "805": "216",
    "806": "119",
    "807": "592",
    "808": "126",
    "809": "368",
    "810": "324",
    "811": "596",
    "812": "20",
    "813": "733",
    "814": "143",
    "815": "441",
    "816": "870",
    "817": "367",
    "818": "895",
    "819": "630",
    "820": "756",
    "821": "562",
    "822": "323",
    "823": "879",
    "824": "155",
    "825": "433",
    "826": "541",
    "827": "775",
    "828": "689",
    "829": "909",
    "830": "513",
    "831": "560",
    "832": "305",
    "833": "936",
    "834": "738",
    "835": "964",
    "836": "643",
    "837": "530",
    "838": "447",
    "839": "491",
    "840": "850",
    "841": "328",
    "842": "467",
    "843": "287",
    "844": "238",
    "845": "750",
    "846": "342",
    "847": "694",
    "848": "869",
    "849": "263",
    "850": "87",
    "851": "211",
    "852": "396",
    "853": "292",
    "854": "11",
    "855": "666",
    "856": "804",
    "857": "660",
    "858": "479",
    "859": "777",
    "860": "86",
    "861": "423",
    "862": "574",
    "863": "550",
    "864": "379",
    "865": "632",
    "866": "200",
    "867": "340",
    "868": "922",
    "869": "227",
    "870": "123",
    "871": "676",
    "872": "679",
    "873": "998",
    "874": "768",
    "875": "618",
    "876": "480",
    "877": "621",
    "878": "593",
    "879": "901",
    "880": "243",
    "881": "498",
    "882": "595",
    "883": "695",
    "884": "505",
    "885": "878",
    "886": "873",
    "887": "174",
    "888": "516",
    "889": "380",
    "890": "166",
    "891": "85",
    "892": "192",
    "893": "77",
    "894": "637",
    "895": "295",
    "896": "761",
    "897": "658",
    "898": "278",
    "899": "634",
    "900": "90",
    "901": "137",
    "902": "99",
    "903": "63",
    "904": "286",
    "905": "185",
    "906": "883",
    "907": "656",
    "908": "586",
    "909": "418",
    "910": "645",
    "911": "82",
    "912": "912",
    "913": "994",
    "914": "890",
    "915": "351",
    "916": "930",
    "917": "978",
    "918": "53",
    "919": "231",
    "920": "508",
    "921": "146",
    "922": "771",
    "923": "46",
    "924": "463",
    "925": "801",
    "926": "951",
    "927": "944",
    "928": "435",
    "929": "283",
    "930": "988",
    "931": "685",
    "932": "158",
    "933": "672",
    "934": "752",
    "935": "847",
    "936": "929",
    "937": "355",
    "938": "742",
    "939": "745",
    "940": "456",
    "941": "5",
    "942": "257",
    "943": "649",
    "944": "915",
    "945": "407",
    "946": "453",
    "947": "189",
    "948": "64",
    "949": "727",
    "950": "892",
    "951": "178",
    "952": "225",
    "953": "39",
    "954": "30",
    "955": "849",
    "956": "410",
    "957": "985",
    "958": "774",
    "959": "284",
    "960": "943",
    "961": "939",
    "962": "758",
    "963": "741",
    "964": "125",
    "965": "452",
    "966": "797",
    "967": "358",
    "968": "490",
    "969": "781",
    "970": "14",
    "971": "746",
    "972": "205",
    "973": "628",
    "974": "520",
    "975": "527",
    "976": "80",
    "977": "997",
    "978": "454",
    "979": "921",
    "980": "361",
    "981": "60",
    "982": "557",
    "983": "306",
    "984": "949",
    "985": "179",
    "986": "401",
    "987": "796",
    "988": "867",
    "989": "114",
    "990": "203",
    "991": "924",
    "992": "712",
    "993": "686",
    "994": "627",
    "995": "108",
    "996": "437",
    "997": "819",
    "998": "514",
    "999": "290"
}