{
    "0": "going",
    "1": "long",
    "2": "review",
    "3": "writing",
    "4": "specifically",
    "5": "iphone",
    "6": "users",
    "7": "mind",
    "8": "user",
    "9": "looking",
    "10": "headtohead",
    "11": "comparison",
    "12": "phone",
    "13": "think",
    "14": "find",
    "15": "helpful",
    "16": "feel",
    "17": "like",
    "18": "read",
    "19": "whole",
    "20": "thing",
    "21": "scroll",
    "22": "subjects",
    "23": "interested",
    "24": "inso",
    "25": "know",
    "26": "coming",
    "27": "quick",
    "28": "background",
    "29": "since",
    "30": "first",
    "31": "came",
    "32": "remember",
    "33": "years",
    "34": "ago",
    "35": "used",
    "36": "year",
    "37": "upgraded",
    "38": "comparing",
    "39": "awesome",
    "40": "much",
    "41": "faster",
    "42": "speeds",
    "43": "combined",
    "44": "operating",
    "45": "system",
    "46": "makes",
    "47": "web",
    "48": "pages",
    "49": "download",
    "50": "seemingly",
    "51": "blazingly",
    "52": "fast",
    "53": "processor",
    "54": "ghz",
    "55": "dual",
    "56": "core",
    "57": "huge",
    "58": "difference",
    "59": "speed",
    "60": "opening",
    "61": "programs",
    "62": "get",
    "63": "accustomed",
    "64": "quickly",
    "65": "blazing",
    "66": "play",
    "67": "games",
    "68": "really",
    "69": "comment",
    "70": "screen",
    "71": "beautiful",
    "72": "bigger",
    "73": "size",
    "74": "nice",
    "75": "amazing",
    "76": "page",
    "77": "view",
    "78": "book",
    "79": "ereader",
    "80": "fans",
    "81": "reading",
    "82": "books",
    "83": "pleasure",
    "84": "life",
    "85": "battery",
    "86": "great",
    "87": "compared",
    "88": "written",
    "89": "got",
    "90": "would",
    "91": "said",
    "92": "abysmal",
    "93": "however",
    "94": "made",
    "95": "couple",
    "96": "greatly",
    "97": "improved",
    "98": "say",
    "99": "better",
    "100": "purchased",
    "101": "app",
    "102": "supposed",
    "103": "improve",
    "104": "could",
    "105": "detect",
    "106": "change",
    "107": "days",
    "108": "later",
    "109": "playing",
    "110": "around",
    "111": "settings",
    "112": "noticed",
    "113": "easily",
    "114": "disable",
    "115": "whichever",
    "116": "features",
    "117": "need",
    "118": "disabling",
    "119": "even",
    "120": "gps",
    "121": "immensely",
    "122": "also",
    "123": "wifi",
    "124": "helps",
    "125": "lot",
    "126": "hotspot",
    "127": "disabled",
    "128": "unless",
    "129": "actually",
    "130": "use",
    "131": "leave",
    "132": "mobile",
    "133": "network",
    "134": "enabled",
    "135": "order",
    "136": "work",
    "137": "bluetooth",
    "138": "onas",
    "139": "two",
    "140": "hours",
    "141": "fully",
    "142": "charged",
    "143": "unplugged",
    "144": "chargers",
    "145": "turned",
    "146": "charge",
    "147": "right",
    "148": "service",
    "149": "cancelled",
    "150": "using",
    "151": "anymore",
    "152": "sensation",
    "153": "still",
    "154": "registering",
    "155": "light",
    "156": "text",
    "157": "messages",
    "158": "minute",
    "159": "calls",
    "160": "actual",
    "161": "far",
    "162": "running",
    "163": "probably",
    "164": "big",
    "165": "concern",
    "166": "able",
    "167": "tmobile",
    "168": "finder",
    "169": "went",
    "170": "lost",
    "171": "forgetting",
    "172": "turn",
    "173": "might",
    "174": "never",
    "175": "findable",
    "176": "accuracy",
    "177": "little",
    "178": "bit",
    "179": "less",
    "180": "close",
    "181": "send",
    "182": "audio",
    "183": "signal",
    "184": "lock",
    "185": "andor",
    "186": "wipe",
    "187": "data",
    "188": "case",
    "189": "lose",
    "190": "necessary",
    "191": "home",
    "192": "screens",
    "193": "sick",
    "194": "static",
    "195": "stale",
    "196": "thought",
    "197": "shoot",
    "198": "look",
    "199": "one",
    "200": "day",
    "201": "themes",
    "202": "htc",
    "203": "weather",
    "204": "completely",
    "205": "interactive",
    "206": "changes",
    "207": "depending",
    "208": "time",
    "209": "partly",
    "210": "cloudy",
    "211": "see",
    "212": "blue",
    "213": "sky",
    "214": "clouds",
    "215": "nighttime",
    "216": "dark",
    "217": "last",
    "218": "night",
    "219": "surprised",
    "220": "instead",
    "221": "looked",
    "222": "foggy",
    "223": "sure",
    "224": "enough",
    "225": "outside",
    "226": "love",
    "227": "theme",
    "228": "constantly",
    "229": "gives",
    "230": "valuable",
    "231": "information",
    "232": "getting",
    "233": "tired",
    "234": "backgrounds",
    "235": "come",
    "236": "installed",
    "237": "visually",
    "238": "appealing",
    "239": "every",
    "240": "automatically",
    "241": "picks",
    "242": "location",
    "243": "apps",
    "244": "request",
    "245": "pick",
    "246": "new",
    "247": "saves",
    "248": "step",
    "249": "puts",
    "250": "front",
    "251": "along",
    "252": "easytoread",
    "253": "megapixel",
    "254": "camera",
    "255": "newest",
    "256": "ipad",
    "257": "apple",
    "258": "products",
    "259": "simply",
    "260": "compare",
    "261": "comes",
    "262": "quality",
    "263": "images",
    "264": "videos",
    "265": "takes",
    "266": "higher",
    "267": "larger",
    "268": "expensive",
    "269": "supposedly",
    "270": "cooler",
    "271": "storage",
    "272": "cards",
    "273": "add",
    "274": "space",
    "275": "becomes",
    "276": "vastly",
    "277": "buy",
    "278": "models",
    "279": "base",
    "280": "price",
    "281": "regardless",
    "282": "card",
    "283": "decide",
    "284": "put",
    "285": "typing",
    "286": "keyboard",
    "287": "looks",
    "288": "similar",
    "289": "somehow",
    "290": "amazingly",
    "291": "type",
    "292": "accurately",
    "293": "may",
    "294": "tactile",
    "295": "feedback",
    "296": "hit",
    "297": "key",
    "298": "maybe",
    "299": "automatic",
    "300": "spell",
    "301": "check",
    "302": "make",
    "303": "fewer",
    "304": "swype",
    "305": "feature",
    "306": "dragging",
    "307": "finger",
    "308": "letter",
    "309": "next",
    "310": "across",
    "311": "uses",
    "312": "regular",
    "313": "gotten",
    "314": "expect",
    "315": "eventually",
    "316": "interestingly",
    "317": "typos",
    "318": "cool",
    "319": "real",
    "320": "large",
    "321": "fingers",
    "322": "hard",
    "323": "easy",
    "324": "ironic",
    "325": "ipads",
    "326": "iphones",
    "327": "mean",
    "328": "happened",
    "329": "wanted",
    "330": "browser",
    "331": "login",
    "332": "tell",
    "333": "device",
    "334": "computer",
    "335": "connect",
    "336": "idiotic",
    "337": "works",
    "338": "fine",
    "339": "including",
    "340": "exactly",
    "341": "way",
    "342": "worked",
    "343": "locate",
    "344": "display",
    "345": "map",
    "346": "audible",
    "347": "additional",
    "348": "function",
    "349": "allows",
    "350": "choose",
    "351": "periodically",
    "352": "frame",
    "353": "minutes",
    "354": "handy",
    "355": "ever",
    "356": "want",
    "357": "track",
    "358": "route",
    "359": "taken",
    "360": "help",
    "361": "catch",
    "362": "thief",
    "363": "tracking",
    "364": "syncing",
    "365": "outlook",
    "366": "calendars",
    "367": "contacts",
    "368": "flawlessly",
    "369": "horrible",
    "370": "sync",
    "371": "air",
    "372": "weeks",
    "373": "stopped",
    "374": "working",
    "375": "together",
    "376": "destroyed",
    "377": "calendar",
    "378": "recovered",
    "379": "creates",
    "380": "multiple",
    "381": "entries",
    "382": "everything",
    "383": "enter",
    "384": "appointment",
    "385": "shows",
    "386": "times",
    "387": "happy",
    "388": "connected",
    "389": "synced",
    "390": "perfectly",
    "391": "try",
    "392": "create",
    "393": "folder",
    "394": "hold",
    "395": "files",
    "396": "good",
    "397": "job",
    "398": "browsing",
    "399": "word",
    "400": "flash",
    "401": "many",
    "402": "sites",
    "403": "fancy",
    "404": "graphics",
    "405": "basic",
    "406": "functionality",
    "407": "totally",
    "408": "locked",
    "409": "viewing",
    "410": "content",
    "411": "website",
    "412": "access",
    "413": "steve",
    "414": "jobs",
    "415": "wake",
    "416": "major",
    "417": "reason",
    "418": "possible",
    "419": "doubletap",
    "420": "zoom",
    "421": "resize",
    "422": "column",
    "423": "sometimes",
    "424": "sideways",
    "425": "enlarge",
    "426": "fit",
    "427": "wider",
    "428": "without",
    "429": "reorient",
    "430": "another",
    "431": "choice",
    "432": "freedom",
    "433": "least",
    "434": "feeling",
    "435": "android",
    "436": "owners",
    "437": "understand",
    "438": "restricted",
    "439": "control",
    "440": "single",
    "441": "digital",
    "442": "rights",
    "443": "management",
    "444": "must",
    "445": "transfer",
    "446": "itunes",
    "447": "file",
    "448": "back",
    "449": "infuriating",
    "450": "almost",
    "451": "things",
    "452": "created",
    "453": "fact",
    "454": "store",
    "455": "approved",
    "456": "brother",
    "457": "believe",
    "458": "legitimate",
    "459": "approve",
    "460": "quite",
    "461": "perfect",
    "462": "biggest",
    "463": "drawback",
    "464": "opinion",
    "465": "give",
    "466": "stars",
    "467": "ability",
    "468": "folders",
    "469": "emulate",
    "470": "none",
    "471": "cumbersome",
    "472": "convoluted",
    "473": "nothing",
    "474": "simplicity",
    "475": "ease",
    "476": "already",
    "477": "decided",
    "478": "shortcuts",
    "479": "filled",
    "480": "main",
    "481": "others",
    "482": "begun",
    "483": "knew",
    "484": "end",
    "485": "cycling",
    "486": "various",
    "487": "nightmare",
    "488": "people",
    "489": "appsthe",
    "490": "droid",
    "491": "tried",
    "492": "solve",
    "493": "problem",
    "494": "visual",
    "495": "appeal",
    "496": "instance",
    "497": "method",
    "498": "involving",
    "499": "select",
    "500": "icon",
    "501": "represent",
    "502": "contents",
    "503": "represented",
    "504": "tiny",
    "505": "icons",
    "506": "cradle",
    "507": "aware",
    "508": "moment",
    "509": "set",
    "510": "lay",
    "511": "flat",
    "512": "desk",
    "513": "prop",
    "514": "enjoy",
    "515": "seeing",
    "516": "especially",
    "517": "unlike",
    "518": "stay",
    "519": "giving",
    "520": "clock",
    "521": "center",
    "522": "within",
    "523": "radios",
    "524": "ihome",
    "525": "house",
    "526": "wherever",
    "527": "take",
    "528": "plug",
    "529": "radio",
    "530": "music",
    "531": "podcasts",
    "532": "pretty",
    "533": "heavily",
    "534": "changed",
    "535": "daily",
    "536": "downloads",
    "537": "whenever",
    "538": "hasslefree",
    "539": "update",
    "540": "human",
    "541": "intervention",
    "542": "copy",
    "543": "separate",
    "544": "trick",
    "545": "primitive",
    "546": "timer",
    "547": "player",
    "548": "sleep",
    "549": "sound",
    "550": "shut",
    "551": "ipod",
    "552": "phonealso",
    "553": "stopwatch",
    "554": "quirky",
    "555": "liked",
    "556": "mornings",
    "557": "slept",
    "558": "bed",
    "559": "earlier",
    "560": "always",
    "561": "default",
    "562": "gets",
    "563": "goes",
    "564": "crazy",
    "565": "something",
    "566": "idea",
    "567": "counting",
    "568": "definitely",
    "569": "downloaded",
    "570": "either",
    "571": "show",
    "572": "trusting",
    "573": "someone",
    "574": "soon",
    "575": "email",
    "576": "program",
    "577": "basically",
    "578": "sucks",
    "579": "html",
    "580": "emails",
    "581": "today",
    "582": "throwback",
    "583": "early",
    "584": "fortunately",
    "585": "though",
    "586": "effort",
    "587": "part",
    "588": "box",
    "589": "achieved",
    "590": "parti",
    "591": "gmail",
    "592": "although",
    "593": "mail",
    "594": "domain",
    "595": "name",
    "596": "account",
    "597": "forward",
    "598": "fortunate",
    "599": "google",
    "600": "lets",
    "601": "customize",
    "602": "address",
    "603": "reply",
    "604": "recipients",
    "605": "benefit",
    "606": "push",
    "607": "open",
    "608": "latest",
    "609": "wait",
    "610": "checked",
    "611": "dialing",
    "612": "unfortunately",
    "613": "voice",
    "614": "rudimentary",
    "615": "form",
    "616": "manually",
    "617": "contact",
    "618": "list",
    "619": "click",
    "620": "search",
    "621": "button",
    "622": "person",
    "623": "call",
    "624": "apparently",
    "625": "tied",
    "626": "names",
    "627": "tricks",
    "628": "former",
    "629": "wish",
    "630": "owner",
    "631": "told",
    "632": "simple",
    "633": "figure",
    "634": "message",
    "635": "found",
    "636": "started",
    "637": "arrow",
    "638": "bottom",
    "639": "hardware",
    "640": "best",
    "641": "friend",
    "642": "index",
    "643": "round",
    "644": "twice",
    "645": "recently",
    "646": "several",
    "647": "ways",
    "648": "quickest",
    "649": "pops",
    "650": "screenanother",
    "651": "often",
    "652": "clear",
    "653": "options",
    "654": "turns",
    "655": "specific",
    "656": "whatever",
    "657": "pop",
    "658": "usually",
    "659": "numbers",
    "660": "messed",
    "661": "trying",
    "662": "bring",
    "663": "top",
    "664": "dell",
    "665": "venue",
    "666": "pro",
    "667": "difficult",
    "668": "game",
    "669": "changer",
    "670": "rally",
    "671": "masses",
    "672": "windows",
    "673": "platform",
    "674": "previous",
    "675": "issues",
    "676": "caused",
    "677": "miss",
    "678": "mark",
    "679": "recent",
    "680": "firmware",
    "681": "restored",
    "682": "faith",
    "683": "based",
    "684": "months",
    "685": "purely",
    "686": "standpoint",
    "687": "dvp",
    "688": "covered",
    "689": "slightly",
    "690": "curved",
    "691": "gorilla",
    "692": "glass",
    "693": "feels",
    "694": "sides",
    "695": "chrome",
    "696": "metallic",
    "697": "plastic",
    "698": "texture",
    "699": "rich",
    "700": "cover",
    "701": "repeating",
    "702": "cut",
    "703": "diamond",
    "704": "pattern",
    "705": "beveled",
    "706": "rubberized",
    "707": "coating",
    "708": "plenty",
    "709": "accents",
    "710": "color",
    "711": "shape",
    "712": "commend",
    "713": "design",
    "714": "exterior",
    "715": "given",
    "716": "professional",
    "717": "general",
    "718": "rarity",
    "719": "among",
    "720": "common",
    "721": "public",
    "722": "pull",
    "723": "crowd",
    "724": "comments",
    "725": "questions",
    "726": "microusb",
    "727": "jack",
    "728": "headphone",
    "729": "decent",
    "730": "volume",
    "731": "rocker",
    "732": "side",
    "733": "dedicated",
    "734": "power",
    "735": "speaker",
    "736": "mic",
    "737": "outs",
    "738": "keeping",
    "739": "speakerphone",
    "740": "accessiblethe",
    "741": "win",
    "742": "beauty",
    "743": "internals",
    "744": "question",
    "745": "devices",
    "746": "date",
    "747": "mandatory",
    "748": "surprise",
    "749": "amount",
    "750": "ram",
    "751": "mystery",
    "752": "originally",
    "753": "listed",
    "754": "removed",
    "755": "spec",
    "756": "third",
    "757": "party",
    "758": "reported",
    "759": "posts",
    "760": "forums",
    "761": "suggest",
    "762": "recognize",
    "763": "correct",
    "764": "reporting",
    "765": "relief",
    "766": "microsoft",
    "767": "releasing",
    "768": "software",
    "769": "incorporates",
    "770": "multitasking",
    "771": "capabilitiesthe",
    "772": "high",
    "773": "prefer",
    "774": "portrait",
    "775": "format",
    "776": "satisfying",
    "777": "travel",
    "778": "distance",
    "779": "buttons",
    "780": "palm",
    "781": "keyboards",
    "782": "slider",
    "783": "mechanism",
    "784": "solid",
    "785": "snap",
    "786": "native",
    "787": "exclusively",
    "788": "favored",
    "789": "towards",
    "790": "considered",
    "791": "useful",
    "792": "quantum",
    "793": "arrive",
    "794": "complication",
    "795": "heft",
    "796": "brick",
    "797": "hand",
    "798": "require",
    "799": "sized",
    "800": "hands",
    "801": "comfortably",
    "802": "reach",
    "803": "tap",
    "804": "small",
    "805": "disastrous",
    "806": "fumble",
    "807": "waiting",
    "808": "amoled",
    "809": "technology",
    "810": "sporting",
    "811": "standard",
    "812": "resolution",
    "813": "samsung",
    "814": "focus",
    "815": "super",
    "816": "deep",
    "817": "blacks",
    "818": "response",
    "819": "gameplay",
    "820": "video",
    "821": "playback",
    "822": "sharp",
    "823": "crisp",
    "824": "downside",
    "825": "washes",
    "826": "direct",
    "827": "sunlight",
    "828": "notch",
    "829": "average",
    "830": "experienced",
    "831": "significant",
    "832": "drops",
    "833": "earpiece",
    "834": "provides",
    "835": "sufficient",
    "836": "environments",
    "837": "bump",
    "838": "while",
    "839": "problems",
    "840": "widely",
    "841": "freeze",
    "842": "marketplace",
    "843": "seems",
    "844": "likely",
    "845": "occur",
    "846": "result",
    "847": "faulty",
    "848": "micro",
    "849": "buried",
    "850": "sim",
    "851": "slot",
    "852": "meant",
    "853": "tampered",
    "854": "fixed",
    "855": "crash",
    "856": "yetthe",
    "857": "edr",
    "858": "pairs",
    "859": "plantronics",
    "860": "headsets",
    "861": "car",
    "862": "curious",
    "863": "circumstance",
    "864": "pair",
    "865": "half",
    "866": "past",
    "867": "pairing",
    "868": "remains",
    "869": "disappointing",
    "870": "aspect",
    "871": "low",
    "872": "expectations",
    "873": "cameras",
    "874": "phones",
    "875": "barely",
    "876": "meets",
    "877": "minimal",
    "878": "requirements",
    "879": "lighting",
    "880": "indoor",
    "881": "drop",
    "882": "exponentially",
    "883": "feet",
    "884": "cause",
    "885": "wash",
    "886": "shifted",
    "887": "performance",
    "888": "stick",
    "889": "performed",
    "890": "tasks",
    "891": "smoothly",
    "892": "responsiveness",
    "893": "generally",
    "894": "flawless",
    "895": "worried",
    "896": "occasion",
    "897": "xbox",
    "898": "live",
    "899": "moving",
    "900": "environment",
    "901": "previously",
    "902": "suffered",
    "903": "slowdown",
    "904": "hiccups",
    "905": "partially",
    "906": "remedied",
    "907": "resetting",
    "908": "directly",
    "909": "returning",
    "910": "hub",
    "911": "slowdowns",
    "912": "seen",
    "913": "upon",
    "914": "addition",
    "915": "negative",
    "916": "aspects",
    "917": "marks",
    "918": "overall",
    "919": "paste",
    "920": "office",
    "921": "outstanding",
    "922": "piece",
    "923": "well",
    "924": "powerful",
    "925": "point",
    "926": "skydrive",
    "927": "practice",
    "928": "presentation",
    "929": "accurate",
    "930": "animations",
    "931": "edits",
    "932": "needs",
    "933": "docs",
    "934": "addict",
    "935": "achievement",
    "936": "points",
    "937": "carries",
    "938": "weight",
    "939": "longtime",
    "940": "zune",
    "941": "pass",
    "942": "subscriber",
    "943": "song",
    "944": "efficient",
    "945": "gorgeous",
    "946": "body",
    "947": "anyone",
    "948": "besides",
    "949": "ios",
    "950": "short",
    "951": "botched",
    "952": "initial",
    "953": "release",
    "954": "killed",
    "955": "tremendous",
    "956": "leading",
    "957": "launch",
    "958": "hey",
    "959": "fulfill",
    "960": "late",
    "961": "initially",
    "962": "released",
    "963": "docked",
    "964": "star",
    "965": "hope",
    "966": "discussing",
    "967": "bumped",
    "968": "market",
    "969": "mango",
    "970": "wrote",
    "971": "month",
    "972": "rolled",
    "973": "total",
    "974": "received",
    "975": "aforementioned",
    "976": "highly",
    "977": "competitive",
    "978": "current",
    "979": "smartphone",
    "980": "scene",
    "981": "reviews",
    "982": "stability",
    "983": "improvements",
    "984": "noticeable",
    "985": "updating",
    "986": "reset",
    "987": "three",
    "988": "friends",
    "989": "typically",
    "990": "free",
    "991": "turnbyturn",
    "992": "directions",
    "993": "prompts",
    "994": "traffic",
    "995": "warnings",
    "996": "talk",
    "997": "siri",
    "998": "casual",
    "999": "commands",
    "1000": "please",
    "1001": "essentially",
    "1002": "forecast",
    "1003": "starts",
    "1004": "chinese",
    "1005": "food",
    "1006": "presented",
    "1007": "restaurants",
    "1008": "recipes",
    "1009": "conveniently",
    "1010": "dictate",
    "1011": "eyeball",
    "1012": "scan",
    "1013": "bar",
    "1014": "codes",
    "1015": "prices",
    "1016": "merchandise",
    "1017": "custom",
    "1018": "twitter",
    "1019": "facebook",
    "1020": "tightly",
    "1021": "integrated",
    "1022": "remote",
    "1023": "navigate",
    "1024": "menus",
    "1025": "hdtv",
    "1026": "group",
    "1027": "tile",
    "1028": "effectively",
    "1029": "grouped",
    "1030": "personal",
    "1031": "follow",
    "1032": "favorite",
    "1033": "obscure",
    "1034": "band",
    "1035": "available",
    "1036": "flight",
    "1037": "status",
    "1038": "delta",
    "1039": "prescription",
    "1040": "walgreens",
    "1041": "stream",
    "1042": "movie",
    "1043": "netflix",
    "1044": "anything",
    "1045": "else",
    "1046": "associated",
    "1047": "remotely",
    "1048": "absolutely",
    "1049": "complete",
    "1050": "limit",
    "1051": "screened",
    "1052": "receive",
    "1053": "consider",
    "1054": "legit",
    "1055": "purchase",
    "1056": "holds",
    "1057": "gift",
    "1058": "runs",
    "1059": "symbian",
    "1060": "anna",
    "1061": "version",
    "1062": "nokia",
    "1063": "java",
    "1064": "smart",
    "1065": "thus",
    "1066": "familiar",
    "1067": "benchmark",
    "1068": "essential",
    "1069": "took",
    "1070": "unparalleled",
    "1071": "pictures",
    "1072": "finely",
    "1073": "stylish",
    "1074": "tight",
    "1075": "lines",
    "1076": "understated",
    "1077": "elegant",
    "1078": "hinge",
    "1079": "mechanisms",
    "1080": "heavier",
    "1081": "fits",
    "1082": "nicely",
    "1083": "pocket",
    "1084": "equinox",
    "1085": "touchscreen",
    "1086": "buzz",
    "1087": "touch",
    "1088": "biggie",
    "1089": "landscape",
    "1090": "surprisingly",
    "1091": "errors",
    "1092": "ask",
    "1093": "coworker",
    "1094": "media",
    "1095": "players",
    "1096": "htcs",
    "1097": "qwerty",
    "1098": "keypad",
    "1099": "shift",
    "1100": "keys",
    "1101": "arrows",
    "1102": "alternate",
    "1103": "yellow",
    "1104": "characters",
    "1105": "left",
    "1106": "positioning",
    "1107": "tad",
    "1108": "actuate",
    "1109": "character",
    "1110": "cycle",
    "1111": "letters",
    "1112": "pressing",
    "1113": "repeatedly",
    "1114": "motorolas",
    "1115": "photos",
    "1116": "focusing",
    "1117": "goodies",
    "1118": "picture",
    "1119": "editor",
    "1120": "integrate",
    "1121": "sad",
    "1122": "carl",
    "1123": "zeiss",
    "1124": "board",
    "1125": "worthy",
    "1126": "swore",
    "1127": "lack",
    "1128": "mechanics",
    "1129": "keeps",
    "1130": "mostly",
    "1131": "unchanged",
    "1132": "podcasting",
    "1133": "missing",
    "1134": "handle",
    "1135": "via",
    "1136": "application",
    "1137": "paid",
    "1138": "capable",
    "1139": "rated",
    "1140": "reportedly",
    "1141": "contain",
    "1142": "bugs",
    "1143": "rss",
    "1144": "feeds",
    "1145": "opera",
    "1146": "suffices",
    "1147": "evolved",
    "1148": "playlists",
    "1149": "stereo",
    "1150": "speakers",
    "1151": "thatbut",
    "1152": "match",
    "1153": "vast",
    "1154": "menu",
    "1155": "option",
    "1156": "imho",
    "1157": "predictably",
    "1158": "formatted",
    "1159": "stride",
    "1160": "edit",
    "1161": "tend",
    "1162": "nearly",
    "1163": "throughout",
    "1164": "needing",
    "1165": "reboot",
    "1166": "mention",
    "1167": "guess",
    "1168": "fixes",
    "1169": "somewhat",
    "1170": "smartphones",
    "1171": "navigating",
    "1172": "tiresome",
    "1173": "plus",
    "1174": "organizing",
    "1175": "junki",
    "1176": "hear",
    "1177": "comparisons",
    "1178": "honestly",
    "1179": "deal",
    "1180": "appears",
    "1181": "snappier",
    "1182": "rendering",
    "1183": "choices",
    "1184": "applications",
    "1185": "etc",
    "1186": "beginning",
    "1187": "recall",
    "1188": "webos",
    "1189": "functionally",
    "1190": "aesthetically",
    "1191": "designed",
    "1192": "bad",
    "1193": "partner",
    "1194": "seem",
    "1195": "lag",
    "1196": "experience",
    "1197": "lags",
    "1198": "boom",
    "1199": "hdmi",
    "1200": "hot",
    "1201": "seriously",
    "1202": "watched",
    "1203": "mounting",
    "1204": "usb",
    "1205": "drive",
    "1206": "opens",
    "1207": "backup",
    "1208": "yet",
    "1209": "ovi",
    "1210": "clearly",
    "1211": "tomtom",
    "1212": "garmin",
    "1213": "loads",
    "1214": "sadly",
    "1215": "chip",
    "1216": "maps",
    "1217": "connection",
    "1218": "full",
    "1219": "justify",
    "1220": "unusual",
    "1221": "cell",
    "1222": "quickoffice",
    "1223": "mine",
    "1224": "exchange",
    "1225": "important",
    "1226": "customizable",
    "1227": "heavy",
    "1228": "laptop",
    "1229": "slow",
    "1230": "starting",
    "1231": "occasionally",
    "1232": "photo",
    "1233": "internet",
    "1234": "sports",
    "1235": "tracker",
    "1236": "panorama",
    "1237": "stitch",
    "1238": "giant",
    "1239": "fring",
    "1240": "startup",
    "1241": "thinks",
    "1242": "member",
    "1243": "sign",
    "1244": "situations",
    "1245": "destroy",
    "1246": "driving",
    "1247": "juice",
    "1248": "charger",
    "1249": "dash",
    "1250": "mount",
    "1251": "equivalent",
    "1252": "strong",
    "1253": "rocks",
    "1254": "sending",
    "1255": "pics",
    "1256": "mms",
    "1257": "tmo",
    "1258": "cough",
    "1259": "min",
    "1260": "enormous",
    "1261": "sony",
    "1262": "ericsson",
    "1263": "different",
    "1264": "thankfully",
    "1265": "pic",
    "1266": "integration",
    "1267": "seconds",
    "1268": "old",
    "1269": "gallery",
    "1270": "kind",
    "1271": "rotating",
    "1272": "companies",
    "1273": "phenomenal",
    "1274": "gone",
    "1275": "sort",
    "1276": "functions",
    "1277": "font",
    "1278": "sizes",
    "1279": "medium",
    "1280": "adding",
    "1281": "item",
    "1282": "row",
    "1283": "suggested",
    "1284": "symbols",
    "1285": "exit",
    "1286": "containing",
    "1287": "everyone",
    "1288": "understands",
    "1289": "offer",
    "1290": "smaller",
    "1291": "estate",
    "1292": "them",
    "1293": "amazon",
    "1294": "formats",
    "1295": "streaming",
    "1296": "gifts",
    "1297": "certainly",
    "1298": "recommend",
    "1299": "let",
    "1300": "dissuade",
    "1301": "extremely",
    "1302": "nitpicky",
    "1303": "mac",
    "1304": "lists",
    "1305": "frankly",
    "1306": "trapped",
    "1307": "ecosystem",
    "1308": "respects",
    "1309": "ready",
    "1310": "particular",
    "1311": "productivity",
    "1312": "integrates",
    "1313": "online",
    "1314": "services",
    "1315": "smoking",
    "1316": "btw",
    "1317": "cellphone",
    "1318": "future",
    "1319": "miles",
    "1320": "notification",
    "1321": "frequently",
    "1322": "called",
    "1323": "number",
    "1324": "scrolling",
    "1325": "widget",
    "1326": "bugger",
    "1327": "local",
    "1328": "mates",
    "1329": "maemo",
    "1330": "guessing",
    "1331": "ton",
    "1332": "verizon",
    "1333": "longer",
    "1334": "sets",
    "1335": "pace",
    "1336": "realm",
    "1337": "adequate",
    "1338": "handling",
    "1339": "offers",
    "1340": "rounded",
    "1341": "worth",
    "1342": "compact",
    "1343": "svelte",
    "1344": "refreshing",
    "1345": "continues",
    "1346": "evolve",
    "1347": "block",
    "1348": "slim",
    "1349": "pocketable",
    "1350": "arranged",
    "1351": "intuitive",
    "1352": "manner",
    "1353": "doubles",
    "1354": "ringvibrate",
    "1355": "toggle",
    "1356": "physical",
    "1357": "appearance",
    "1358": "subject",
    "1359": "taste",
    "1360": "wager",
    "1361": "unattractive",
    "1362": "white",
    "1363": "vibrant",
    "1364": "visibly",
    "1365": "unassuming",
    "1366": "black",
    "1367": "loud",
    "1368": "eyes",
    "1369": "despite",
    "1370": "relatively",
    "1371": "wasted",
    "1372": "liking",
    "1373": "bright",
    "1374": "pixelation",
    "1375": "whatsoever",
    "1376": "due",
    "1377": "considering",
    "1378": "width",
    "1379": "length",
    "1380": "fairness",
    "1381": "product",
    "1382": "dimensions",
    "1383": "relation",
    "1384": "empty",
    "1385": "face",
    "1386": "rear",
    "1387": "facing",
    "1388": "flush",
    "1389": "layout",
    "1390": "chargingdata",
    "1391": "port",
    "1392": "headset",
    "1393": "located",
    "1394": "latter",
    "1395": "manufacturer",
    "1396": "upside",
    "1397": "featured",
    "1398": "charging",
    "1399": "ports",
    "1400": "middle",
    "1401": "items",
    "1402": "discussion",
    "1403": "fortune",
    "1404": "mistake",
    "1405": "break",
    "1406": "money",
    "1407": "flaw",
    "1408": "tested",
    "1409": "variety",
    "1410": "locations",
    "1411": "encountered",
    "1412": "dropouts",
    "1413": "conversational",
    "1414": "blips",
    "1415": "callers",
    "1416": "overly",
    "1417": "warm",
    "1418": "robotic",
    "1419": "sounded",
    "1420": "included",
    "1421": "suffers",
    "1422": "wax",
    "1423": "paper",
    "1424": "effect",
    "1425": "reception",
    "1426": "bars",
    "1427": "everywhere",
    "1428": "rarely",
    "1429": "dropped",
    "1430": "usage",
    "1431": "standby",
    "1432": "varies",
    "1433": "regard",
    "1434": "particularly",
    "1435": "blackberry",
    "1436": "slower",
    "1437": "observed",
    "1438": "fiancee",
    "1439": "carrier",
    "1440": "issue",
    "1441": "loading",
    "1442": "webpages",
    "1443": "areas",
    "1444": "spend",
    "1445": "range",
    "1446": "upload",
    "1447": "normal",
    "1448": "slowly",
    "1449": "hoping",
    "1450": "upgrades",
    "1451": "consistent",
    "1452": "terms",
    "1453": "carriers",
    "1454": "area",
    "1455": "ranges",
    "1456": "anywhere",
    "1457": "theoretically",
    "1458": "systems",
    "1459": "concluded",
    "1460": "differences",
    "1461": "easier",
    "1462": "harder",
    "1463": "rim",
    "1464": "simpler",
    "1465": "offered",
    "1466": "competitors",
    "1467": "widgets",
    "1468": "mess",
    "1469": "rhyme",
    "1470": "pleasant",
    "1471": "wonders",
    "1472": "personally",
    "1473": "become",
    "1474": "organization",
    "1475": "fire",
    "1476": "begins",
    "1477": "delve",
    "1478": "deeper",
    "1479": "memorize",
    "1480": "frustrating",
    "1481": "example",
    "1482": "worse",
    "1483": "final",
    "1484": "note",
    "1485": "babysitting",
    "1486": "constant",
    "1487": "attention",
    "1488": "rooting",
    "1489": "solves",
    "1490": "families",
    "1491": "hobbies",
    "1492": "unnecessary",
    "1493": "annoyance",
    "1494": "customization",
    "1495": "entire",
    "1496": "business",
    "1497": "reputation",
    "1498": "suggests",
    "1499": "inferior",
    "1500": "charm",
    "1501": "pdf",
    "1502": "render",
    "1503": "basics",
    "1504": "category",
    "1505": "multimedia",
    "1506": "mixed",
    "1507": "bag",
    "1508": "shots",
    "1509": "stellar",
    "1510": "distortion",
    "1511": "beyond",
    "1512": "blown",
    "1513": "away",
    "1514": "capabilities",
    "1515": "sold",
    "1516": "dropping",
    "1517": "perhaps",
    "1518": "underwhelming",
    "1519": "impressive",
    "1520": "impressively",
    "1521": "washed",
    "1522": "appstore",
    "1523": "impress",
    "1524": "migrating",
    "1525": "handful",
    "1526": "hindrance",
    "1527": "handles",
    "1528": "youtube",
    "1529": "knock",
    "1530": "hype",
    "1531": "receives",
    "1532": "rather",
    "1533": "subtle",
    "1534": "package",
    "1535": "overblown",
    "1536": "mid",
    "1537": "requires",
    "1538": "maintenance",
    "1539": "lte",
    "1540": "stand",
    "1541": "apart",
    "1542": "lineup",
    "1543": "finally",
    "1544": "guys",
    "1545": "arena",
    "1546": "move",
    "1547": "carried",
    "1548": "broadband",
    "1549": "signed",
    "1550": "multitude",
    "1551": "consolidated",
    "1552": "sense",
    "1553": "offerings",
    "1554": "plans",
    "1555": "sprint",
    "1556": "unlimited",
    "1557": "wimax",
    "1558": "truly",
    "1559": "reasonable",
    "1560": "evo",
    "1561": "specs",
    "1562": "promising",
    "1563": "preordered",
    "1564": "waited",
    "1565": "command",
    "1566": "responds",
    "1567": "blink",
    "1568": "eye",
    "1569": "thank",
    "1570": "pdas",
    "1571": "fantastic",
    "1572": "course",
    "1573": "boasts",
    "1574": "boosts",
    "1575": "operates",
    "1576": "handled",
    "1577": "simultaneouslythe",
    "1578": "equally",
    "1579": "paired",
    "1580": "story",
    "1581": "shabby",
    "1582": "tests",
    "1583": "networks",
    "1584": "shown",
    "1585": "mbps",
    "1586": "downstream",
    "1587": "lows",
    "1588": "proved",
    "1589": "wireless",
    "1590": "workdays",
    "1591": "customer",
    "1592": "netbook",
    "1593": "secure",
    "1594": "security",
    "1595": "password",
    "1596": "permit",
    "1597": "allowed",
    "1598": "second",
    "1599": "setting",
    "1600": "equates",
    "1601": "router",
    "1602": "filtering",
    "1603": "certain",
    "1604": "addresses",
    "1605": "dream",
    "1606": "experiences",
    "1607": "sensible",
    "1608": "interface",
    "1609": "friendly",
    "1610": "trouble",
    "1611": "adapting",
    "1612": "supports",
    "1613": "protocol",
    "1614": "allowing",
    "1615": "transfers",
    "1616": "resources",
    "1617": "synchronize",
    "1618": "synchronization",
    "1619": "companion",
    "1620": "link",
    "1621": "advantage",
    "1622": "providers",
    "1623": "support",
    "1624": "means",
    "1625": "configured",
    "1626": "computers",
    "1627": "effortlessly",
    "1628": "aliph",
    "1629": "jawbone",
    "1630": "retail",
    "1631": "packaging",
    "1632": "prime",
    "1633": "blah",
    "1634": "discovery",
    "1635": "stowaway",
    "1636": "ultraslim",
    "1637": "bought",
    "1638": "excited",
    "1639": "wellthe",
    "1640": "internal",
    "1641": "include",
    "1642": "microsd",
    "1643": "replaced",
    "1644": "class",
    "1645": "microsdhc",
    "1646": "memory",
    "1647": "availability",
    "1648": "cloud",
    "1649": "plan",
    "1650": "anticipate",
    "1651": "stored",
    "1652": "streams",
    "1653": "stuttering",
    "1654": "road",
    "1655": "auto",
    "1656": "universal",
    "1657": "transmitter",
    "1658": "speakersthe",
    "1659": "built",
    "1660": "experimenting",
    "1661": "resulted",
    "1662": "interesting",
    "1663": "viewed",
    "1664": "websites",
    "1665": "pleased",
    "1666": "limited",
    "1667": "usefulness",
    "1668": "builtin",
    "1669": "locator",
    "1670": "shops",
    "1671": "near",
    "1672": "destination",
    "1673": "telenav",
    "1674": "direction",
    "1675": "robust",
    "1676": "inch",
    "1677": "portable",
    "1678": "navigation",
    "1679": "texttospeech",
    "1680": "alerts",
    "1681": "grown",
    "1682": "advanced",
    "1683": "lane",
    "1684": "guidance",
    "1685": "neither",
    "1686": "gave",
    "1687": "boast",
    "1688": "pay",
    "1689": "monthly",
    "1690": "subscription",
    "1691": "fee",
    "1692": "extra",
    "1693": "standalone",
    "1694": "lifetime",
    "1695": "instructions",
    "1696": "conditioning",
    "1697": "radiothe",
    "1698": "complaint",
    "1699": "five",
    "1700": "disappointment",
    "1701": "absence",
    "1702": "kickstand",
    "1703": "movies",
    "1704": "resolved",
    "1705": "purchasing",
    "1706": "dock",
    "1707": "icarpus",
    "1708": "holding",
    "1709": "spare",
    "1710": "regards",
    "1711": "performs",
    "1712": "performing",
    "1713": "prolong",
    "1714": "shutting",
    "1715": "currently",
    "1716": "disconnects",
    "1717": "habit",
    "1718": "turning",
    "1719": "interest",
    "1720": "sparing",
    "1721": "conversation",
    "1722": "run",
    "1723": "hung",
    "1724": "keep",
    "1725": "plugged",
    "1726": "touched",
    "1727": "watching",
    "1728": "preloaded",
    "1729": "green",
    "1730": "spiderman",
    "1731": "neat",
    "1732": "maximum",
    "1733": "external",
    "1734": "heat",
    "1735": "lucky",
    "1736": "snapdragon",
    "1737": "vivid",
    "1738": "rocksolid",
    "1739": "cutting",
    "1740": "edge",
    "1741": "spectrum",
    "1742": "contract",
    "1743": "upfront",
    "1744": "beat",
    "1745": "intercept",
    "1746": "reasonably",
    "1747": "priced",
    "1748": "cost",
    "1749": "brand",
    "1750": "customers",
    "1751": "changing",
    "1752": "this",
    "1753": "virgin",
    "1754": "realize",
    "1755": "fault",
    "1756": "stable",
    "1757": "thin",
    "1758": "lightweight",
    "1759": "thinness",
    "1760": "durable",
    "1761": "cases",
    "1762": "concrete",
    "1763": "replace",
    "1764": "out",
    "1765": "wife",
    "1766": "inches",
    "1767": "safe",
    "1768": "dualcore",
    "1769": "chips",
    "1770": "asked",
    "1771": "instantaneously",
    "1772": "snappy",
    "1773": "taking",
    "1774": "recorder",
    "1775": "flashlight",
    "1776": "recharge",
    "1777": "consistently",
    "1778": "gradually",
    "1779": "not",
    "1780": "are",
    "1781": "vanilla",
    "1782": "skin",
    "1783": "bunch",
    "1784": "bloatware",
    "1785": "stock",
    "1786": "preinstalled",
    "1787": "fill",
    "1788": "depends",
    "1789": "cities",
    "1790": "terrible",
    "1791": "operate",
    "1792": "parent",
    "1793": "company",
    "1794": "rural",
    "1795": "lifeline",
    "1796": "coverage",
    "1797": "otherwise",
    "1798": "international",
    "1799": "therefore",
    "1800": "roam",
    "1801": "internationally",
    "1802": "roaming",
    "1803": "hotel",
    "1804": "shop",
    "1805": "skype",
    "1806": "cheaper",
    "1807": "freei",
    "1808": "strongly",
    "1809": "ditch",
    "1810": "extent",
    "1811": "letting",
    "1812": "fix",
    "1813": "situation",
    "1814": "archaic",
    "1815": "government",
    "1816": "regulation",
    "1817": "laws",
    "1818": "consumers",
    "1819": "showing",
    "1820": "wallet",
    "1821": "report",
    "1822": "provide",
    "1823": "purse",
    "1824": "hip",
    "1825": "scratches",
    "1826": "unexpected",
    "1827": "restarts",
    "1828": "putting",
    "1829": "inadvertently",
    "1830": "pressed",
    "1831": "restart",
    "1832": "triumph",
    "1833": "continue",
    "1834": "updates",
    "1835": "disappointed",
    "1836": "updated",
    "1837": "gingerbread",
    "1838": "improving",
    "1839": "acceptable",
    "1840": "cheap",
    "1841": "possibly",
    "1842": "implemented",
    "1843": "per",
    "1844": "billing",
    "1845": "soft",
    "1846": "cap",
    "1847": "approach",
    "1848": "fair",
    "1849": "benefits",
    "1850": "dramatically",
    "1851": "technical",
    "1852": "mediocre",
    "1853": "excellenti",
    "1854": "premium",
    "1855": "offering",
    "1856": "steal",
    "1857": "summer",
    "1858": "grandfathered",
    "1859": "tethering",
    "1860": "torn",
    "1861": "wanting",
    "1862": "compatible",
    "1863": "jump",
    "1864": "greatest",
    "1865": "highway",
    "1866": "complained",
    "1867": "drain",
    "1868": "motorola",
    "1869": "responsive",
    "1870": "smile",
    "1871": "owned",
    "1872": "performers",
    "1873": "original",
    "1874": "slideout",
    "1875": "reliable",
    "1876": "upgrade",
    "1877": "incredible",
    "1878": "winner",
    "1879": "concerned",
    "1880": "connectivity",
    "1881": "bulky",
    "1882": "thinner",
    "1883": "lighter",
    "1884": "sharper",
    "1885": "brighter",
    "1886": "kept",
    "1887": "dress",
    "1888": "pants",
    "1889": "uncomfortable",
    "1890": "distracting",
    "1891": "protective",
    "1892": "forced",
    "1893": "rely",
    "1894": "tool",
    "1895": "mainly",
    "1896": "sun",
    "1897": "moderate",
    "1898": "daylight",
    "1899": "school",
    "1900": "pals",
    "1901": "dim",
    "1902": "produced",
    "1903": "blur",
    "1904": "zones",
    "1905": "prints",
    "1906": "pixels",
    "1907": "imaging",
    "1908": "improvement",
    "1909": "share",
    "1910": "newspaper",
    "1911": "impressed",
    "1912": "continually",
    "1913": "odd",
    "1914": "responding",
    "1915": "needed",
    "1916": "force",
    "1917": "closed",
    "1918": "glitch",
    "1919": "overtheair",
    "1920": "ota",
    "1921": "virtually",
    "1922": "minor",
    "1923": "glitches",
    "1924": "onscreen",
    "1925": "making",
    "1926": "hitting",
    "1927": "wear",
    "1928": "ring",
    "1929": "cramped",
    "1930": "haptic",
    "1931": "vibration",
    "1932": "keystrokes",
    "1933": "correcting",
    "1934": "circle",
    "1935": "cursor",
    "1936": "magnified",
    "1937": "window",
    "1938": "allow",
    "1939": "precise",
    "1940": "position",
    "1941": "problematic",
    "1942": "strain",
    "1943": "daughter",
    "1944": "manage",
    "1945": "communication",
    "1946": "remain",
    "1947": "wall",
    "1948": "travelingi",
    "1949": "remembered",
    "1950": "place",
    "1951": "compartment",
    "1952": "placed",
    "1953": "whopping",
    "1954": "comprehensive",
    "1955": "assessment",
    "1956": "pros",
    "1957": "seamless",
    "1958": "editing",
    "1959": "input",
    "1960": "opposed",
    "1961": "traditional",
    "1962": "tapping",
    "1963": "social",
    "1964": "excellent",
    "1965": "creative",
    "1966": "composition",
    "1967": "tagging",
    "1968": "cabled",
    "1969": "headphones",
    "1970": "shoots",
    "1971": "true",
    "1972": "connects",
    "1973": "connections",
    "1974": "installation",
    "1975": "includes",
    "1976": "extended",
    "1977": "prove",
    "1978": "some",
    "1979": "recommended",
    "1980": "cable",
    "1981": "adaptor",
    "1982": "demos",
    "1983": "utilized",
    "1984": "ringtone",
    "1985": "selection",
    "1986": "yields",
    "1987": "annoying",
    "1988": "stacks",
    "1989": "favorably",
    "1990": "summary",
    "1991": "stays",
    "1992": "truck",
    "1993": "driveway",
    "1994": "mounted",
    "1995": "stuffing",
    "1996": "cord",
    "1997": "sunvisor",
    "1998": "lowered",
    "1999": "supertooth",
    "2000": "buddy",
    "2001": "miniusb",
    "2002": "magnetic",
    "2003": "clip",
    "2004": "setup",
    "2005": "done",
    "2006": "press",
    "2007": "sounds",
    "2008": "texas",
    "2009": "exceeds",
    "2010": "degrees",
    "2011": "inside",
    "2012": "caller",
    "2013": "rings",
    "2014": "jabra",
    "2015": "cruiser",
    "2016": "announces",
    "2017": "parked",
    "2018": "kid",
    "2019": "aluminum",
    "2020": "foil",
    "2021": "wrap",
    "2022": "forget",
    "2023": "accessible",
    "2024": "digging",
    "2025": "why",
    "2026": "answer",
    "2027": "callso",
    "2028": "silly",
    "2029": "disconnected",
    "2030": "backpack",
    "2031": "seat",
    "2032": "most",
    "2033": "strike",
    "2034": "freak",
    "2035": "occurrence",
    "2036": "reasons",
    "2037": "mentioned",
    "2038": "above",
    "2039": "visor",
    "2040": "onoff",
    "2041": "warning",
    "2042": "wonderful",
    "2043": "poor",
    "2044": "reliability",
    "2045": "broke",
    "2046": "overheat",
    "2047": "disconnect",
    "2048": "occurred",
    "2049": "warranty",
    "2050": "period",
    "2051": "newer",
    "2052": "roadster",
    "2053": "researched",
    "2054": "hesitant",
    "2055": "freeway",
    "2056": "save",
    "2057": "pursuit",
    "2058": "handsfree",
    "2059": "minus",
    "2060": "frills",
    "2061": "units",
    "2062": "returned",
    "2063": "halo",
    "2064": "seemed",
    "2065": "cupholder",
    "2066": "unit",
    "2067": "defaults",
    "2068": "checking",
    "2069": "knows",
    "2070": "blueant",
    "2071": "return",
    "2072": "trip",
    "2073": "errands",
    "2074": "vent",
    "2075": "assumption",
    "2076": "test",
    "2077": "reaches",
    "2078": "max",
    "2079": "level",
    "2080": "beep",
    "2081": "with",
    "2082": "asap",
    "2083": "related",
    "2084": "finagling",
    "2085": "involved",
    "2086": "climate",
    "2087": "luck",
    "2088": "mentions",
    "2089": "sitting",
    "2090": "couch",
    "2091": "manufacturers",
    "2092": "added",
    "2093": "blackberries",
    "2094": "torch",
    "2095": "cdma",
    "2096": "goodness",
    "2097": "surprising",
    "2098": "releases",
    "2099": "anywho",
    "2100": "bold",
    "2101": "wondering",
    "2102": "hated",
    "2103": "storm",
    "2104": "brought",
    "2105": "style",
    "2106": "whose",
    "2107": "urge",
    "2108": "notice",
    "2109": "wonder",
    "2110": "rid",
    "2111": "lining",
    "2112": "yes",
    "2113": "fan",
    "2114": "haha",
    "2115": "calculations",
    "2116": "nfc",
    "2117": "nearfield",
    "2118": "developers",
    "2119": "protect",
    "2120": "balance",
    "2121": "monitor",
    "2122": "configure",
    "2123": "disappears",
    "2124": "disappear",
    "2125": "separates",
    "2126": "stuff",
    "2127": "avoid",
    "2128": "possibility",
    "2129": "accidentally",
    "2130": "sent",
    "2131": "shady",
    "2132": "slick",
    "2133": "comparatively",
    "2134": "speaking",
    "2135": "usable",
    "2136": "operations",
    "2137": "start",
    "2138": "liquid",
    "2139": "alot",
    "2140": "research",
    "2141": "smoother",
    "2142": "cleaner",
    "2143": "distinct",
    "2144": "fluid",
    "2145": "heard",
    "2146": "alright",
    "2147": "die",
    "2148": "kicking",
    "2149": "plugging",
    "2150": "carry",
    "2151": "practically",
    "2152": "week",
    "2153": "breaks",
    "2154": "marker",
    "2155": "communications",
    "2156": "reaching",
    "2157": "century",
    "2158": "global",
